src/toir_cf/src/Reports/торо_ПланЗакупок/торо_ПланЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_ПланЗакупок</name>
</mdclass:Report>

src/toir_cf/src/AccumulationRegisters/торо_ЗаказыПоставщику/торо_ЗаказыПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ЗаказыПоставщику</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.торо_ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cf/src/InformationRegisters/торо_ИнтеграцияДокументов/торо_ИнтеграцияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИнтеграцияДокументов</name>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументТОИР</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументЕРП</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_ОбщиеДанныеПоРемонтам/торо_ОбщиеДанныеПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОбщиеДанныеПоРемонтам</name>
  <resources>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьНаряд</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьАкт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьАктПриемки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВидДокументаНачалаЦепочки</name>
    <type>
      <types>EnumRef.торо_ВидыДокументовНачалаЦепочкиРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеИнициатор</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументНачалаЦепочки</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаВнутреннееПотребление</name>
  <registerRecords>InformationRegister.проф_ЗаменаНаАналоги</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаВнутреннееПотребление</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_СозданПоПотребности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>торо_ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_СтатусУтверждения</name>
    <type>
      <types>EnumRef.торо_СтатусыУтвержденияЗаказовНаВП</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.проф_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_Назначение</name>
    <type>
      <types>CatalogRef.проф_Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ЗаказДляЗакупки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.проф_ХозяйственнаяОперация</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ДатаУтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_КЗВП</name>
    <type>
      <types>EnumRef.проф_КЗВПДО</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ТипЗаказа</name>
    <type>
      <types>EnumRef.проф_ТипЗаказа</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>торо_СтатусУтверждения</name>
      <type>
        <types>EnumRef.торо_СтатусыУтвержденияСтрокЗаказовНаВП</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_КатегорииЭксплуатации</name>
      <type>
        <types>CatalogRef.проф_КатегорииЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_ПризнакЗапчасти</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_КЗаказу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_ПричинаОтмены</name>
      <type>
        <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
        <types>CatalogRef.проф_ПричиныОтмены</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_Отменил</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>торо_ЗамененныеАналогамиМатериалы</name>
    <attributes>
      <name>КодСтрокиАналога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиНоменклатуры</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>проф_ТоварыИсточника</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/Reports/торо_ПланЗакупок/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
		// Никаких настроек не требуется	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	КлючВарианта = КомпоновщикНастроек.Настройки.ДополнительныеСвойства.КлючПредопределенногоВарианта;
	Если КлючВарианта = "ПланЗакупок" Тогда 
		СхемаКомпоновкиДанных.НаборыДанных.ИсточникСвязи.Запрос = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	торо_ЗаказыПоставщикуОстатки.Номенклатура КАК Номенклатура,
		|	торо_ЗаказыПоставщикуОстатки.Характеристика КАК Характеристика,
		|	торо_ЗаказыПоставщикуОстатки.Склад КАК Склад,
		|	торо_ЗаказыПоставщикуОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
		|	торо_ЗаказыПоставщикуОстатки.КоличествоОстаток КАК КоличествоЗакупленное,
		|	торо_ЗаказыПоставщикуОстатки.ЗаказПоставщику.ДатаПоставки КАК ДатаПоставки,
		|	торо_ЗаказыПоставщикуОстатки.ЗаказПоставщику.Организация КАК Организация,
		|	торо_ЗаказыПоставщикуОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	торо_ЗаказыПоставщикуОстатки.ЗаказПоставщику.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.торо_ЗаказыПоставщику.Остатки(&ДатаОкончания,{ЗаказПоставщику.ДатаПоставки МЕЖДУ &ДатаНачала И &ДатаОкончания} ) КАК торо_ЗаказыПоставщикуОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.Номенклатура КАК Номенклатура,
		|	ВТ_Остатки.Характеристика КАК Характеристика,
		|	ВТ_Остатки.Склад КАК Склад,
		|	ВТ_Остатки.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ВТ_Остатки.КоличествоЗакупленное КАК КоличествоЗакупленное,
		|	ВТ_Остатки.ДатаПоставки КАК ДатаПоставки,
		|	ВТ_Остатки.Организация КАК Организация,
		|	ВТ_Остатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_Остатки.Контрагент КАК Контрагент
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки"; 
		
		СхемаКомпоновкиДанных.НаборыДанных.ПриемникСвязи.Запрос = "ВЫБРАТЬ
		|	торо_ИнтеграцияДокументов.ID КАК ID,
		|	ЗаказНаВнутреннееПотребление.Ссылка КАК Ссылка,
		|	ЗаказНаВнутреннееПотребление.ДатаОтгрузки КАК Дата,
		|	ЗаказНаВнутреннееПотребление.торо_ОбъектРемонта КАК ОбъектРемонта,
		|	ЗаказНаВнутреннееПотребление.торо_ВидРемонта КАК ВидРемонта
		|ПОМЕСТИТЬ ВТ_ИДРемонтов
		|ИЗ
		|	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление
		|		ПО торо_ИнтеграцияДокументов.ДокументЕРП = ЗаказНаВнутреннееПотребление.Ссылка
		|{ГДЕ
		|	ЗаказНаВнутреннееПотребление.ДатаОтгрузки МЕЖДУ &ДатаНачала И &ДатаОкончания}
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИДРемонтов.Ссылка КАК Ссылка,
		|	ВТ_ИДРемонтов.ID КАК ID,
		|	ВТ_ИДРемонтов.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА ВТ_ИДРемонтов.ВидРемонта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка)
		|			ТОГДА торо_ОбщиеДанныеПоРемонтам.ВидРемонта
		|		ИНАЧЕ ВТ_ИДРемонтов.ВидРемонта
		|	КОНЕЦ КАК ВидРемонта,
		|	ВЫБОР
		|		КОГДА ВТ_ИДРемонтов.ОбъектРемонта = НЕОПРЕДЕЛЕНО
		|			ТОГДА торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта
		|		ИНАЧЕ ВТ_ИДРемонтов.ОбъектРемонта
		|	КОНЕЦ КАК ОбъектРемонта
		|ПОМЕСТИТЬ ВТ_ЗаказыНаВП
		|ИЗ
		|	ВТ_ИДРемонтов КАК ВТ_ИДРемонтов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
		|		ПО ВТ_ИДРемонтов.ID = торо_ОбщиеДанныеПоРемонтам.IDРемонта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыНаВП.Ссылка КАК Ссылка,
		|	ВТ_ЗаказыНаВП.ID КАК ID,
		|	ВТ_ЗаказыНаВП.Дата КАК Дата,
		|	ВТ_ЗаказыНаВП.ВидРемонта КАК ВидРемонта,
		|	ВТ_ЗаказыНаВП.ОбъектРемонта КАК ОбъектРемонта,
		|	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура КАК Номенклатура,
		|	ЗаказНаВнутреннееПотреблениеТовары.Характеристика КАК Характеристика,
		|	ЗаказНаВнутреннееПотреблениеТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	ВТ_ЗаказыНаВП КАК ВТ_ЗаказыНаВП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление.Товары КАК ЗаказНаВнутреннееПотреблениеТовары
		|		ПО ВТ_ЗаказыНаВП.Ссылка = ЗаказНаВнутреннееПотреблениеТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ЗаказПоставщикуДокументыОснования.Ссылка КАК ЗаказПоставщику,
		|	ВТ_Товары.Ссылка КАК ЗаказНаВП,
		|	ВТ_Товары.Дата КАК ДатаПотребности,
		|	ВТ_Товары.ВидРемонта КАК ВидРемонта,
		|	ВТ_Товары.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК КоличествоТребуемое
		|ИЗ
		|	Документ.торо_ЗаказПоставщику.ДокументыОснования КАК торо_ЗаказПоставщикуДокументыОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
		|		ПО торо_ЗаказПоставщикуДокументыОснования.ДокументОснование = ВТ_Товары.Ссылка
		|{ГДЕ
		|	торо_ЗаказПоставщикуДокументыОснования.Ссылка.ДатаПоставки МЕЖДУ &ДатаНачала И &ДатаОкончания}";
		
	ИначеЕсли КлючВарианта = "ПланПоставокПодВП" Тогда
		
		СхемаКомпоновкиДанных.НаборыДанных.ПриемникСвязи.Запрос = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	торо_ЗаказыПоставщикуОстатки.Номенклатура КАК Номенклатура,
		|	торо_ЗаказыПоставщикуОстатки.Характеристика КАК Характеристика,
		|	торо_ЗаказыПоставщикуОстатки.Склад КАК Склад,
		|	торо_ЗаказыПоставщикуОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
		|	торо_ЗаказыПоставщикуОстатки.КоличествоОстаток КАК КоличествоЗакупленное,
		|	торо_ЗаказыПоставщикуОстатки.ЗаказПоставщику.ДатаПоставки КАК ДатаПоставки,
		|	торо_ЗаказыПоставщикуОстатки.ЗаказПоставщику.Организация КАК Организация,
		|	торо_ЗаказыПоставщикуОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	торо_ЗаказыПоставщикуОстатки.ЗаказПоставщику.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.торо_ЗаказыПоставщику.Остатки(&ДатаОкончания,{ЗаказПоставщику.ДатаПоставки МЕЖДУ &ДатаНачала И &ДатаОкончания} ) КАК торо_ЗаказыПоставщикуОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.Номенклатура КАК Номенклатура,
		|	ВТ_Остатки.Характеристика КАК Характеристика,
		|	ВТ_Остатки.Склад КАК Склад,
		|	ВТ_Остатки.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ВТ_Остатки.КоличествоЗакупленное КАК КоличествоЗакупленное,
		|	ВТ_Остатки.ДатаПоставки КАК ДатаПоставки,
		|	ВТ_Остатки.Организация КАК Организация,
		|	ВТ_Остатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_Остатки.Контрагент КАК Контрагент
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки"; 
		
		СхемаКомпоновкиДанных.НаборыДанных.ИсточникСвязи.Запрос = "ВЫБРАТЬ
		|	торо_ИнтеграцияДокументов.ID КАК ID,
		|	ЗаказНаВнутреннееПотребление.Ссылка КАК Ссылка,
		|	ЗаказНаВнутреннееПотребление.ДатаОтгрузки КАК Дата,
		|	ЗаказНаВнутреннееПотребление.торо_ОбъектРемонта КАК ОбъектРемонта,
		|	ЗаказНаВнутреннееПотребление.торо_ВидРемонта КАК ВидРемонта
		|ПОМЕСТИТЬ ВТ_ИДРемонтов
		|ИЗ
		|	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление
		|		ПО торо_ИнтеграцияДокументов.ДокументЕРП = ЗаказНаВнутреннееПотребление.Ссылка
		|{ГДЕ
		|	ЗаказНаВнутреннееПотребление.ДатаОтгрузки МЕЖДУ &ДатаНачала И &ДатаОкончания}
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИДРемонтов.Ссылка КАК Ссылка,
		|	ВТ_ИДРемонтов.ID КАК ID,
		|	ВТ_ИДРемонтов.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА ВТ_ИДРемонтов.ВидРемонта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка)
		|			ТОГДА торо_ОбщиеДанныеПоРемонтам.ВидРемонта
		|		ИНАЧЕ ВТ_ИДРемонтов.ВидРемонта
		|	КОНЕЦ КАК ВидРемонта,
		|	ВЫБОР
		|		КОГДА ВТ_ИДРемонтов.ОбъектРемонта = НЕОПРЕДЕЛЕНО
		|			ТОГДА торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта
		|		ИНАЧЕ ВТ_ИДРемонтов.ОбъектРемонта
		|	КОНЕЦ КАК ОбъектРемонта
		|ПОМЕСТИТЬ ВТ_ЗаказыНаВП
		|ИЗ
		|	ВТ_ИДРемонтов КАК ВТ_ИДРемонтов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
		|		ПО ВТ_ИДРемонтов.ID = торо_ОбщиеДанныеПоРемонтам.IDРемонта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыНаВП.Ссылка КАК Ссылка,
		|	ВТ_ЗаказыНаВП.ID КАК ID,
		|	ВТ_ЗаказыНаВП.Дата КАК Дата,
		|	ВТ_ЗаказыНаВП.ВидРемонта КАК ВидРемонта,
		|	ВТ_ЗаказыНаВП.ОбъектРемонта КАК ОбъектРемонта,
		|	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура КАК Номенклатура,
		|	ЗаказНаВнутреннееПотреблениеТовары.Характеристика КАК Характеристика,
		|	ЗаказНаВнутреннееПотреблениеТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	ВТ_ЗаказыНаВП КАК ВТ_ЗаказыНаВП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление.Товары КАК ЗаказНаВнутреннееПотреблениеТовары
		|		ПО ВТ_ЗаказыНаВП.Ссылка = ЗаказНаВнутреннееПотреблениеТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ЗаказПоставщикуДокументыОснования.Ссылка КАК ЗаказПоставщику,
		|	ВТ_Товары.Ссылка КАК ЗаказНаВП,
		|	ВТ_Товары.Дата КАК ДатаПотребности,
		|	ВТ_Товары.ВидРемонта КАК ВидРемонта,
		|	ВТ_Товары.ОбъектРемонта КАК ОбъектРемонта,
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК КоличествоТребуемое
		|ИЗ
		|	Документ.торо_ЗаказПоставщику.ДокументыОснования КАК торо_ЗаказПоставщикуДокументыОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
		|		ПО торо_ЗаказПоставщикуДокументыОснования.ДокументОснование = ВТ_Товары.Ссылка
		|{ГДЕ
		|	торо_ЗаказПоставщикуДокументыОснования.Ссылка.ДатаПоставки МЕЖДУ &ДатаНачала И &ДатаОкончания}";
	КонецЕсли;	
	
КонецПроцедуры 

#КонецОбласти  


#КонецЕсли
